{
  "A_floor": 0.0001,
  "architectures": [
    "Mamba3ForCausalLM"
  ],
  "bos_token_id": 1,
  "chunk_size": 64,
  "dt_init_floor": 0.0001,
  "dt_max": 0.1,
  "dt_min": 0.001,
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "expand": 2,
  "fuse_cross_entropy": true,
  "fuse_linear_cross_entropy": false,
  "fuse_norm": true,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 1024,
  "initializer_range": 0.02,
  "is_mimo": false,
  "is_outproj_norm": false,
  "mimo_rank": 4,
  "model_type": "mamba3",
  "n_groups": 1,
  "norm_eps": 1e-05,
  "num_heads": 32,
  "num_hidden_layers": 48,
  "pad_token_id": 0,
  "rescale_prenorm_residual": true,
  "residual_in_fp32": true,
  "rmsnorm": true,
  "rope_fraction": 0.5,
  "state_size": 128,
  "tie_word_embeddings": false,
  "transformers_version": "5.5.0",
  "use_bias": false,
  "use_cache": false,
  "use_l2warp": false,
  "vocab_size": 32000
}
